drmoorevt/PRIME/Firmware/PRIME/environment/STM32Cube/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f429i_discovery_lcd.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

DAC_HandleTypeDef hdac;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

SPI_HandleTypeDef hspi5;

TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim7;

UART_HandleTypeDef huart5;
UART_HandleTypeDef huart1;

SRAM_HandleTypeDef hsram1;
SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DAC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_SPI5_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_UART5_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

#include <stdlib.h>
#include <stdbool.h>

static struct
{
  bool ramTest;
} sMain;

#define FT232H_DATA_AVAILABLE  (0x01)
#define FT232H_SPACE_AVAILABLE (0x02)
#define FT232H_SUSPEND         (0x04)
#define FT232H_CONFIGURED      (0x08)
#define FT232H_BUFFER_SIZE     (1024)
static char helloString[FT232H_BUFFER_SIZE];

uint8_t volatile * const pDataPipe = (uint8_t *)0x64000000;
uint8_t volatile * const pStatPipe = (uint8_t *)0x64000001;
  
void Main_sendUSB(uint8_t *pBuf, uint32_t len)
{
  while(len--)
  {
    while(!(*pStatPipe & FT232H_SPACE_AVAILABLE));
    *(pDataPipe) = *pBuf++;
  }
}

void Main_testUSB(void)
{
  #define FT232H_DATA_AVAILABLE  (0x01)
  #define FT232H_SPACE_AVAILABLE (0x02)
  #define FT232H_SUSPEND         (0x04)
  #define FT232H_CONFIGURED      (0x08)
  #define FT232H_BUFFER_SIZE     (1024)
  
  uint32_t i;
  uint32_t size;
  uint32_t counter = 0;
  volatile uint32_t j;
  volatile uint8_t status;
  volatile uint8_t inChar;
  
  //for (counter = 0; counter < 3426; counter++)
  while(1)
  {
    for (j = 0; j < 9; j++)
    {
      for (i = 0x30; i < 0x50; i++)
      {
        while(!(*pStatPipe & FT232H_SPACE_AVAILABLE));
        *(pDataPipe) = i;
      }
    }
    *(pDataPipe) = (uint8_t)'\r';
    *(pDataPipe) = (uint8_t)'\n';
  }
  
  while (1)
  {
    status = (*pStatPipe & 0x0F);
    if (status & FT232H_CONFIGURED)
    {
      if (status & FT232H_DATA_AVAILABLE)
      {
        while (status & FT232H_DATA_AVAILABLE)
        {
          inChar = *pDataPipe;
          //memset(helloString, 0, 0);
          //Util_fillMemory(helloString, sizeof(helloString), 0x00);
          size = sprintf(helloString, "inChar = %c\r\n", inChar);
          for (i = 0; i < size; i++)
            *(pDataPipe) = helloString[i];
          status = (*pStatPipe & 0x0F);
        }
        for (j = 0; j < 10000000; j++);
      }
      else if (status & FT232H_SPACE_AVAILABLE)
      {
        size = sprintf(helloString, "Hello World @ 480Mbps! Status = %X, Counter = %d \r\n", status, counter++);
        for (i = 0; i < size; i++)
          *(pDataPipe) = helloString[i];
      }
      else
      {
        for (j = 0; j < 10000000; j++);
      }
    }
  }
  
  
  while (1)
  {
    status = (*pStatPipe & 0x0F);
    if (status & FT232H_CONFIGURED)
    {
      if (status & FT232H_DATA_AVAILABLE)
      {
        while (status & FT232H_DATA_AVAILABLE)
        {
          inChar = *pDataPipe;
          //memset(helloString, 0, 0);
          //Util_fillMemory(helloString, sizeof(helloString), 0x00);
          size = sprintf(helloString, "inChar = %c\r\n", inChar);
          for (i = 0; i < size; i++)
            *(pDataPipe) = helloString[i];
          status = (*pStatPipe & 0x0F);
        }
        for (j = 0; j < 10000000; j++);
      }
      else if (status & FT232H_SPACE_AVAILABLE)
      {
        size = sprintf(helloString, "Hello World @ 480Mbps! Status = %X, Counter = %d \r\n", status, counter++);
        for (i = 0; i < size; i++)
          *(pDataPipe) = helloString[i];
      }
    }
  }
}

void Main_testPowerSupplies(void)
{
  uint32_t counter = 0;
  ADC_ChannelConfTypeDef sConfig;
  ADC_HandleTypeDef *adcNum;
  sConfig.Channel = ADC_CHANNEL_VREFINT;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  //uint16_t dacOut = 0;
  //HAL_DACEx_TriangleWaveGenerate(&hdac, DAC_CHANNEL_2, DAC_TRIANGLEAMPLITUDE_4095);
   
  while(1)
  {
    char outBuf[64];
    uint32_t chanNum, adcVal, outLen;
    HAL_DAC_SetValue(&hdac, DAC_CHANNEL_2, DAC_ALIGN_12B_R, counter++);
    HAL_DAC_Start(&hdac, DAC_CHANNEL_2);
    switch (counter)
    {
      case 0:
        HAL_GPIO_WritePin(VADJ1_0_GPIO_Port, VADJ1_0_Pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(VADJ1_1_GPIO_Port, VADJ1_1_Pin, GPIO_PIN_RESET);
        break;
      case 1023:
        HAL_GPIO_WritePin(VADJ1_0_GPIO_Port, VADJ1_0_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(VADJ1_1_GPIO_Port, VADJ1_1_Pin, GPIO_PIN_RESET);
        break;
      case 2047:
        HAL_GPIO_WritePin(VADJ1_0_GPIO_Port, VADJ1_0_Pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(VADJ1_1_GPIO_Port, VADJ1_1_Pin, GPIO_PIN_SET);
        break;
      case 3071:
        HAL_GPIO_WritePin(VADJ1_0_GPIO_Port, VADJ1_0_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(VADJ1_1_GPIO_Port, VADJ1_1_Pin, GPIO_PIN_SET);
        break;
      case 4095:
        counter = 0;
        break;
    }
    for (chanNum = 0; chanNum < 9; chanNum++)
    {
      switch (chanNum)
      {
        case 0: sConfig.Channel = ADC_CHANNEL_VREFINT; adcNum = &hadc1; break;  // Vref
        case 1: sConfig.Channel = ADC_CHANNEL_1;       adcNum = &hadc1; break;  // PII1 
        case 2: sConfig.Channel = ADC_CHANNEL_2;       adcNum = &hadc1; break;  // PII2
        
        case 3: sConfig.Channel = ADC_CHANNEL_7;       adcNum = &hadc2; break;  // PV0
        case 4: sConfig.Channel = ADC_CHANNEL_14;      adcNum = &hadc2; break;  // PV1
        case 5: sConfig.Channel = ADC_CHANNEL_15;      adcNum = &hadc2; break;  // PV2
        
